#Использовать 1testrunner
#Использовать fs

Функция ПрогнатьТесты()
	
	КаталогРезультатов = ОбъединитьПути(".temp", "tests");
	
	//ФС.ОбеспечитьПустойКаталог(".temp");
	ФС.ОбеспечитьПустойКаталог(КаталогРезультатов);
	
	КаталогТестов = Новый Файл("tests");
	КаталогОтчета = Новый Файл(КаталогРезультатов);	

	Тестер = Новый Тестер;
	Тестер.ТестироватьКаталог(КаталогТестов, КаталогОтчета);
	
	Возврат Истина;
	
КонецФункции

ТестыПрошлиУспешно = ПрогнатьТесты();

Если Не ТестыПрошлиУспешно Тогда
	Сообщить("Тесты провалены");
	ЗавершитьРаботу(- 1);
КонецЕсли;
