#Использовать "../pkg/ring"

#Область ОбработчикиТестов

Процедура Dummy() Экспорт
	// Закрывает баг движка OneScript: https://github.com/EvilBeaver/OneScript/issues/1087 
КонецПроцедуры

&Тест
Процедура Тест_ДолженПолучитьВерсиюУтилиты() Экспорт
	
	// Дано
	РегулярноеВыражение = Новый РегулярноеВыражение("^(\d*).(\d*).(\d*)-(\d*)$");
	Менеджер = Новый МенеджерRing();
	
	// Когда
	Версия = Менеджер.Версия();
	
	// Тогда
	Ожидаем.Что(Версия).ИмеетТип("Строка");
	Ожидаем.Что(РегулярноеВыражение.Совпадает(Версия)).ЕстьИстина();
	
КонецПроцедуры

&Тест
Процедура Тест_ДолженПолучитьУстановленныеМодули() Экспорт
	
	// Дано
	Менеджер = Новый МенеджерRing();
	
	// Когда
	УстановленныеМодули = Менеджер.УстановленныеМодули();
	
	// Тогда
	Ожидаем.Что(УстановленныеМодули).ИмеетТип("СписокМодулейRing");
	Ожидаем.Что(УстановленныеМодули.Количество()).Больше(0);
	
КонецПроцедуры

#КонецОбласти